/***********************************************************************************************************************
*   ѕрограммирование Flash пам€ти таргета через программный SWD
*       «нает про SWD из библиотеки soft_SWD.h
*       «нает про Flash конкретного таргета из библиотеки конкретного таргета (пока только N32g45x_Flash.h)
***********************************************************************************************************************/

#ifndef __FLASH_PROGRAMMER_H__
#define __FLASH_PROGRAMMER_H__

#include "soft_SWD.h"
#include "N32G45x_Flash.h"
//#include "STM32Fxx_Flash.h" дл€ каждого вида целевых ћ  нужна сво€ библиотека, где будут прописаны регистры, маски и адреса


#endif /* __FLASH_PROGRAMMER_H__ */