/**
  * @file    uart.h
  * @brief   Файл содержит прототипы функций UART
  */

/** Define to prevent recursive inclusion *****************************************************************************/
#ifndef __UART_H__
#define __UART_H__

/** Includes **********************************************************************************************************/
#include "CMSIS/stm32f4xx.h"

/** Defines ***********************************************************************************************************/

/** Functions *********************************************************************************************************/

	/**
	! Включение модуля UART/USART.
	- USARTx - выбранный модуль UART/USART.
	*/
void USART_Enable(USART_TypeDef* USARTx);




#endif /*__UART_H__ */